denbilyk/altaris-hw-stm32/src/usb/hw_config.c
/**
 ******************************************************************************
 * @file    hw_config.c
 * @author  MCD Application Team
 * @version V4.0.0
 * @date    21-January-2013
 * @brief   Hardware Configuration & Setup
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "hw_config.h"
#include "usb_lib.h"
#include "usb_desc.h"
#include "usb_pwr.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define USB_STATES	6
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
ErrorStatus HSEStartUpStatus;
EXTI_InitTypeDef EXTI_InitStructure;
const char *st[USB_STATES] = { "UNCONNECTED", "ATTACHED", "POWERED", "SUSPENDED", "ADDRESSED", "CONFIGURED", };

/* Extern variables ----------------------------------------------------------*/
extern __IO uint8_t PrevXferComplete;

/* Private function prototypes -----------------------------------------------*/
static void IntToUnicode(uint32_t value, uint8_t *pbuf, uint8_t len);
/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
 * Additional function
 *******************************************************************************/
const char *get_usb_state_name(uint32_t state) {
	if (state > USB_STATES)
		return "UNKNOWN";
	return st[state];
}

/*******************************************************************************
 * Function Name  : Set_System
 * Description    : Configures Main system clocks & power.
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void Set_System(void) {

	/*!< At this stage the microcontroller clock setting is already configured,
	 this is done through SystemInit() function which is called from startup
	 file (startup_stm32xxx.s) before to branch to application main.
	 To reconfigure the default setting of SystemInit() function, refer to
	 system_stm32xxx.c file
	 */

	/* Enable the PWR clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

#if defined(USB_USE_EXTERNAL_PULLUP)
	/* Enable the USB disconnect GPIO clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIO_DISCONNECT, ENABLE);

	/* USB_DISCONNECT used as USB pull-up */
	GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure);
#endif /* USB_USE_EXTERNAL_PULLUP */

	//RCC_APB2PeriphClockCmd(RCC_GPIO, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
//  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOE, ENABLE);
	GPIO_InitTypeDef port;

	/* Button1 */
	port.GPIO_Mode = GPIO_Mode_IPU;
	port.GPIO_Pin = BTN1_PIN;
	port.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(BTN1_PORT, &port);
	/* Button2 */
	port.GPIO_Mode = GPIO_Mode_IPU;
	port.GPIO_Pin = BTN2_PIN;
	port.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_Init(BTN2_PORT, &port);

	/* LED1&2 */
	/*port.GPIO_Mode = GPIO_Mode_Out_PP;
	 port.GPIO_Pin = LED1_PIN | LED2_PIN | LED3_PIN;
	 port.GPIO_Speed = GPIO_Speed_2MHz;
	 GPIO_Init(LED_PORT, &port);*/

	/* Configure the EXTI line 18 connected internally to the USB IP ************/
	/*EXTI_ClearITPendingBit(EXTI_Line18);
	 EXTI_InitStructure.EXTI_Line = EXTI_Line18;
	 EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
	 EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	 EXTI_Init(&EXTI_InitStructure);
	 */
}

/*******************************************************************************
 * Function Name  : Set_USBClock
 * Description    : Configures USB Clock input (48MHz).
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void Set_USBClock(void) {
#if defined(STM32L1XX_MD) || defined(STM32L1XX_HD)|| defined(STM32L1XX_MD_PLUS)
	/* Enable USB clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);

#else
	/* Select USBCLK source */
	RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_1Div5);

	/* Enable the USB clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);
#endif /* STM32L1XX_XD */

}

/*******************************************************************************
 * Function Name  : Enter_LowPowerMode.
 * Description    : Power-off system clocks and power while entering suspend mode.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void Enter_LowPowerMode(void) {
	/* Set the device state to suspend */
	bDeviceState = SUSPENDED;

	/* Clear EXTI Line18 pending bit */
//  EXTI_ClearITPendingBit(KEY_BUTTON_EXTI_LINE);
	/* Request to enter STOP mode with regulator in low power mode */
	//PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);
}

/*******************************************************************************
 * Function Name  : Leave_LowPowerMode.
 * Description    : Restores system clocks and power while exiting suspend mode.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void Leave_LowPowerMode(void) {
	DEVICE_INFO *pInfo = &Device_Info;

	/* Set the device state to the correct state */
	if (pInfo->Current_Configuration != 0) {
		/* Device configured */
		bDeviceState = CONFIGURED;
	} else {
		bDeviceState = ATTACHED;
	}

	/*Enable SystemCoreClock*/
	SystemInit();
}

/*******************************************************************************
 * Function Name  : USB_Interrupts_Config.
 * Description    : Configures the USB interrupts.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void USB_Interrupts_Config(void) {
	NVIC_InitTypeDef NVIC_InitStructure;

	/* 2 bit for pre-emption priority, 2 bits for subpriority */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

#if defined(STM32L1XX_MD)|| defined(STM32L1XX_HD) || defined(STM32L1XX_MD_PLUS)
	/* Enable the USB interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the USB Wake-up interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_FS_WKUP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

#elif defined(STM32F37X)
	/* Enable the USB interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the USB Wake-up interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USBWakeUp_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

#else /* USE_STM3210B_EVAL or USE_STM3210E_EVAL */
	/* Enable the USB interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable the USB Wake-up interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USBWakeUp_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_Init(&NVIC_InitStructure);
#endif
}

/*******************************************************************************
 * Function Name  : USB_Cable_Config.
 * Description    : Software Connection/Disconnection of USB Cable.
 * Input          : NewState: new state.
 * Output         : None.
 * Return         : None
 *******************************************************************************/
void USB_Cable_Config(FunctionalState NewState) {
#if defined(STM32L1XX_MD) || defined(STM32L1XX_HD)|| defined(STM32L1XX_MD_PLUS)
	if (NewState != DISABLE)
	{
		STM32L15_USB_CONNECT;
	}
	else
	{
		STM32L15_USB_DISCONNECT;
	}

#else
	if (NewState != DISABLE) {
		GPIO_ResetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
	} else {
		GPIO_SetBits(USB_DISCONNECT, USB_DISCONNECT_PIN);
	}
#endif /* STM32L1XX_MD */
}
/*******************************************************************************
 * Function Name : RHIDCheckState.
 * Description   : Decodes the RHID state.
 * Input         : None.
 * Output        : None.
 * Return value  : The state value.
 *******************************************************************************/
uint8_t Buffer[RPT4_COUNT + 1];
uint16_t btn1_prev, btn2_prev;
uint8_t RHIDCheckState(void) {
	uint16_t btn1 = 0, btn2 = 0;
	btn1 = GPIO_ReadInputDataBit(BTN1_PORT, BTN1_PIN);
	btn2 = GPIO_ReadInputDataBit(BTN2_PORT, BTN2_PIN);
	Buffer[0] = 4;
	Buffer[1] = btn1;
	Buffer[2] = btn2;
	Buffer[3] = (0x55 | 0x67); //My custom data

	/* Reset the control token to inform upper layer that a transfer is ongoing*/
	PrevXferComplete = 0;

	/* Copy mouse position info in ENDP1 Tx Packet Memory Area */
	USB_SIL_Write(EP1_IN, Buffer, RPT4_COUNT + 1);
	/* Enable endpoint for transmission */
	SetEPTxValid(ENDP1);

	return (btn1 | btn2 << 1);
}


void SendDataForRequest() {
		/* Reset the control token to inform upper layer that a transfer is ongoing */
		PrevXferComplete = 0;

		/* Copy mouse position info in ENDP1 Tx Packet Memory Area */
		USB_SIL_Write(EP1_IN, Buffer, RPT4_COUNT + 1);
		/* Enable endpoint for transmission */
		SetEPTxValid(ENDP1);
}

/*******************************************************************************
 * Function Name : RHID_Send.
 * Description   : prepares buffer to be sent containing event infos.
 * Input         : Keys: keys received from terminal.
 * Output        : None.
 * Return value  : None.
 *******************************************************************************/
void RHID_Send(uint8_t report, uint8_t state) {
	uint8_t Buffer[2] = { 0, 0 };

	Buffer[0] = report;
	Buffer[1] = state;

	/* Reset the control token to inform upper layer that a transfer is ongoing */
	PrevXferComplete = 0;

	/* Copy buttons data in ENDP1 Tx Packet Memory Area*/
	USB_SIL_Write(EP1_IN, Buffer, 2);
	/* Enable endpoint for transmission */
	SetEPTxValid(ENDP1);
}

/*******************************************************************************
 * Function Name  : Get_SerialNum.
 * Description    : Create the serial number string descriptor.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void Get_SerialNum(void) {
	uint32_t Device_Serial0, Device_Serial1, Device_Serial2;

	Device_Serial0 = *(uint32_t*) ID1;
	Device_Serial1 = *(uint32_t*) ID2;
	Device_Serial2 = *(uint32_t*) ID3;

	Device_Serial0 += Device_Serial2;

	if (Device_Serial0 != 0) {
		IntToUnicode(Device_Serial0, &RHID_StringSerial[2], 8);
		IntToUnicode(Device_Serial1, &RHID_StringSerial[18], 4);
	}
}

/*******************************************************************************
 * Function Name  : HexToChar.
 * Description    : Convert Hex 32Bits value into char.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
static void IntToUnicode(uint32_t value, uint8_t *pbuf, uint8_t len) {
	uint8_t idx = 0;

	for (idx = 0; idx < len; idx++) {
		if (((value >> 28)) < 0xA) {
			pbuf[2 * idx] = (value >> 28) + '0';
		} else {
			pbuf[2 * idx] = (value >> 28) + 'A' - 10;
		}

		value = value << 4;

		pbuf[2 * idx + 1] = 0;
	}
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
